[
	{
		"id": "neuroshima-hex-3.0", 
		"name": "Neuroshima Hex 3.0", 
		"snippet": "Neuroshima Hex! is a strategy game set in the post-apocalyptic world of Neuroshima, a Polish role-playing game. Each player leads one of four armies: Borgo, Hegemonia (Hegemony), Moloch, and Posterunek (Outpost). Each army deck consists of 34 tiles: soldiers, support tiles, and special actions. You win when all enemy headquarters are destroyed or when your headquarters is the least damaged at the end of the game."
	},
	{
		"id": "elysium", 
		"name": "Elysium", 
		"snippet": "Mythic Greece. As an upstart demigod, you want to earn the favor of the Olympians and become a figure of legend yourself. Gather heroes and powerful artifacts, please the gods and bear their power to write your own epic tale. Let your allies achieve their destiny and enter the Elysium, home of the glorious and the brave. Once the stories are written, only one demigod will be chosen to stand at the side of Zeus. Elysium is a game of set collecting and combinations in which players recruit cards representing heroes, items, powers and gods. These cards have many different powers and you can create powerful combination to earn gold (the help of the gods) and victory points (the favor of the gods). Each card belongs to one of the eight Olympians gods (a family), and shows a level (1 to 3)."
	},
	{
		"id": "terra-mystica", 
		"name": "Terra Mystica", 
		"snippet": "In the land of Terra Mystica dwell 14 different peoples in seven landscapes, and each group is bound to its own home environment, so to develop and grow, they must terraform neighboring landscapes into their home environments in competition with the other groups. Terra Mystica is a game with very little luck that rewards strategic planning. Each player governs one of the 14 groups. With subtlety and craft, the player must attempt to rule as great an area as possible and to develop that group's skills. There are also four religious cults in which you can progress. To do all that, each group has special skills and abilities."
	},
	{
		"id": "evolution", 
		"name": "Evolution", 
		"snippet": "In Evolution, players adapt their species in a dynamic ecosystem where food is scarce and predators lurk. Traits like Hard Shell and Horns will protect your species from Carnivores, while a Long Neck will help them get food that others cannot reach. With over 4,000 ways to evolve your species, every game becomes a different adventure. Evolution packs a surprising amount of variety for a game with simple rules. The variety comes from the synergies between the trait cards and from the different personalities at the table. Some players thrive on creating Carnivores to wreak havoc on their fellow players. Others prefer to stay protected and mind their own business."
	},
	{
		"id": "madeira", 
		"name": "Madeira", 
		"snippet": "Madeira is an island officially discovered early in the 15th century by Portuguese seafarers. Madeira, the Portuguese word for wood, refers to the dense forest that covered its wild, fertile landscape. This, and its strategic position far into the Atlantic Ocean made the island one of the most significant Portuguese discoveries. Madeira served as a “laboratory” for what would become the Portuguese Empire. Wheat plantations were the first means for survival on the island. After that, when D. Henrique decided to increase the economy of the Empire, sugar became the core business of Madeira. Once sugar started coming from other places in the world, such as Africa and Brazil, profits from sugar were no longer enough, and production of the very famous Madeira wine became the most important economic product of the island."
	},
	{
		"id": "argonauts", 
		"name": "Argonauts", 
		"snippet": "Argonauts is a cooperative game that requires careful strategic planning and just a bit of luck, as even the best laid plans, can fall victim to the wrath of the Gods. The game’s objectives are to acquire the Golden Fleece and return safely to Iolkos without losing Argo or too many members of her crew. Each player controls heroes that participated in the Argonaut campaign, each with his / her own set of skills and special abilities. Following the journey from the myth, the Argonauts must face mythical monsters like Scylla and Harybdis, Harpies, Sirens, the construct Talos and the dragon guarding the Fleece, not to mention the perilous journey full of lethal encounters with merciless pirates or having to weather destructive thunderstorms all the while making sure their cargo hold is well stocked with the necessary supplies for the journey to and from Kolchis and their ship sea-worthy."
	}
]
