{
	"designer" : "Lefteris Iroglidis",
	"publisher" : "AlycyonCreative",
	"year_published" : "2015",
	"number_of_players" : "1-4",
	"description": "As the legend goes, Jason was a prince of Iolkos. His father Aeson, the king, was dethroned by Pelias, the king’s brother. The usurper Pelias gave Aeson his word that when Jason will come of age, he will give crown and throne to the young prince, but that was a promise he did not intend to keep. When Jason, a young man now, confronted Pelias and asked him to honor his word, the usurper tasked Jason with a seemingly impossible quest to prove that he is worthy of the throne of Iolkos. He had to recover the Golden Fleece from the distant city of Kolchis. Jason accepted and sent word to famous heroes to aid him in his quest. Hercules, Orpheus, the brothers Kastor and Polydefkis, Laertes the father of Ulysses, were some of the 50 heroes who answered Jason’s call and joined him in his noble quest on board the legendary ship Argo. Argonauts is a cooperative game that requires careful strategic planning and just a bit of luck, as even the best laid plans, can fall victim to the wrath of the Gods. The game’s objectives are to acquire the Golden Fleece and return safely to Iolkos without losing Argo or too many members of her crew. Each player controls heroes that participated in the Argonaut campaign, each with his / her own set of skills and special abilities. Following the journey from the myth, the Argonauts must face mythical monsters like Scylla and Harybdis, Harpies, Sirens, the construct Talos and the dragon guarding the Fleece, not to mention the perilous journey full of lethal encounters with merciless pirates or having to weather destructive thunderstorms all the while making sure their cargo hold is well stocked with the necessary supplies for the journey to and from Kolchis and their ship sea-worthy. Each turn, the players must decide which of their characters will participate in the encounter they face, dealing with threats with either might or cunning and keeping in mind that these characters will be unavailable to face the next encounter due to exhaustion. But the Argonauts are not alone in their quest. The Gods occasionally take interest in their actions, either helping or hindering the progress of our heroes, laying careful plans to waste", 
	"id": "argonauts", 
	"name": "Argonauts",
	"playing_time" : "60 minutes",
	"category" : "Mythology",
	"subdomain" : "Strategy game",
	"suggested_age" : "10 and up"
}
